Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 234, 234, 64)      9472      
_________________________________________________________________
activation (Activation)      (None, 234, 234, 64)      0         
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 117, 117, 64)      0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 115, 115, 64)      36928     
_________________________________________________________________
activation_1 (Activation)    (None, 115, 115, 64)      0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 57, 57, 64)        0         
_________________________________________________________________
flatten (Flatten)            (None, 207936)            0         
_________________________________________________________________
dense (Dense)                (None, 64)                13307968  
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 65        
_________________________________________________________________
activation_2 (Activation)    (None, 1)                 0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 1)                 0         
_________________________________________________________________
dense_2 (Dense)              (None, 4)                 8         
=================================================================
Total params: 13,354,441
Trainable params: 13,354,441
Non-trainable params: 0
_________________________________________________________________
