Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 234, 234, 64)      9472      
_________________________________________________________________
activation (Activation)      (None, 234, 234, 64)      0         
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 117, 117, 64)      0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 111, 111, 32)      100384    
_________________________________________________________________
activation_1 (Activation)    (None, 111, 111, 32)      0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 55, 55, 32)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 49, 49, 16)        25104     
_________________________________________________________________
activation_2 (Activation)    (None, 49, 49, 16)        0         
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 24, 24, 16)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 18, 18, 8)         6280      
_________________________________________________________________
activation_3 (Activation)    (None, 18, 18, 8)         0         
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 9, 9, 8)           0         
_________________________________________________________________
flatten (Flatten)            (None, 648)               0         
_________________________________________________________________
dense (Dense)                (None, 4)                 2596      
_________________________________________________________________
dense_1 (Dense)              (None, 4)                 20        
_________________________________________________________________
activation_4 (Activation)    (None, 4)                 0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 4)                 0         
_________________________________________________________________
dense_2 (Dense)              (None, 4)                 20        
=================================================================
Total params: 143,876
Trainable params: 143,876
Non-trainable params: 0
_________________________________________________________________
